Mabeltranpe1/stm32-course-mabeltranpe/Clase_librerias_hal/Src/parcial_final.c
}

void i2c_init(void){

	__HAL_RCC_I2C1_CLK_ENABLE();

	__HAL_RCC_GPIOB_CLK_ENABLE();

	GPIO_InitTypeDef GPIO_Init = {0};

	//PB6 --> SCL
	//PB7 --> SDA

	GPIO_Init.Pin =  GPIO_PIN_6 | GPIO_PIN_7;  //CONFIGURACION DE PINES DE SDA(PB7) Y SCL(PB6)
	GPIO_Init.Mode = GPIO_MODE_AF_OD;
	GPIO_Init.Pull = GPIO_NOPULL;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_Init.Alternate = GPIO_AF4_I2C1;

	HAL_GPIO_Init(GPIOB, &GPIO_Init);


	//configuracion del I2C

	hi2c.Instance = I2C1;
	//velocidad de transmicion estandar
	hi2c.Init.ClockSpeed = 400000;
	hi2c.Init.DutyCycle = I2C_DUTYCYCLE_2;
	hi2c.Init.OwnAddress1 = 0;
	hi2c.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c.Init.OwnAddress2 = 0;
	hi2c.Init.GeneralCallMode =I2C_GENERALCALL_DISABLED;
	hi2c.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;

	HAL_I2C_Init(&hi2c);

}

void mpu6050_Init(void){
	uint8_t Data;

	Data = 0x00;

	HAL_I2C_Mem_Write(&hi2c,WHOAMI, PWR_MGMT_1_REG, 1, &Data, 1, 100);

	Data = 0x07;

	HAL_I2C_Mem_Write(&hi2c,WHOAMI, SMPLRT_DIV_REG, 1, &Data, 1, 100);

	Data  =  0x00;

	HAL_I2C_Mem_Write(&hi2c,WHOAMI, ACCEL_CONFIG_REG, 1, &Data, 1, 100);

}

void mpu6050_Read (void){

	uint8_t Rec_Data [6];
	HAL_StatusTypeDef status;

	//TIME OUT A 100MS PARA EVITAR QUE SE CONGELE POR MUCHO TIEMPO SI SE DESCONECTA
	status = HAL_I2C_Mem_Read(&hi2c, WHOAMI, ACCEL_XOUT_H_REG, 1, Rec_Data, 6 ,100 );

	if (status == HAL_OK){

		int16_t x = (int16_t)(Rec_Data[0] <<8 | Rec_Data [1]);
		int16_t y = (int16_t)(Rec_Data[2] <<8 | Rec_Data [3]);
		int16_t z = (int16_t)(Rec_Data[4] <<8 | Rec_Data [5]);

		if (x == 0 && y==0 && z==0){
			char str[] = "sensor en sleep mode, Waking Up .. \r\n";
			HAL_UART_Transmit(&huart2,(uint8_t *)str, strlen(str), 100);
			mpu6050_Init();
		}
		else{
			Accel_X_raw = x;
			Accel_Y_raw = y;
			Accel_Z_raw = z;

			Ax = Accel_X_raw / 16384.0;
			Ay = Accel_Y_raw / 16384.0;
			Az = Accel_Z_raw / 16384.0;
		}
	}
	else {
		char err_msg[64];
		int len = sprintf(err_msg, "[DEBUG] Error I2C (status=%d). Reintentando...\r\n", status);
		HAL_UART_Transmit(&huart2, (uint8_t *)err_msg, len, 100);

		// Si el bus I2C está bloqueado, se re-inicializa el periférico I2C1 de la STM32
		if (status == HAL_BUSY) {
			HAL_I2C_DeInit(&hi2c);
			HAL_I2C_Init(&hi2c);
		}

		mpu6050_Init();

	}
}

/*------FUNCIONES DE LA PANTALLA OLED-----*/
void WriteCmd(uint8_t c) {
	HAL_I2C_Mem_Write(&hi2c, SSD1306_ADDR, 0x00, 1, &c, 1, 10);
	// hi2c        -> I2C handle (PB6/PB7, configured in i2c1_Init)
	// SSD1306_ADDR -> 7-bit I2C slave address of the display (0x78, already shifted for R/W)
	// 0x00         -> "control register": D/C#=0 -> command mode
	// 1            -> control register address is 1 byte wide
	// &c, 1        -> the command byte itself, 1 byte to send
	// 10           -> I2C timeout in milliseconds
}


/*
 * SSD1306_Init
 *
 * SSD1306 controller startup sequence (Solomon Systech datasheet,
 * Rev 1.1, sections 9 "Command Table" and 10 "Command Descriptions").
 *
 * Leaves the controller configured with:
 *   - Page Addressing Mode (one "page" = 8 pixel rows, 8 pages -> 64 rows)
 *   - "Mirrored" orientation (Segment Remap + inverted COM Scan) so the
 *     module reads correctly given the typical physical mounting of these OLEDs
 *   - Multiplex 1:64, offset 0 -> 128x64 panel
 *   - Internal charge pump enabled (mandatory since the module is powered
 *     only from logic VDD, with no external panel VCC)
 *   - Display kept OFF until the very last command (0xAF), so no garbage
 *     is shown while it's being configured
 *
 * Each byte is sent with WriteCmd(), which sets D/C#=0 (command) by writing
 * to the SSD1306's 0x00 "control register" over I2C (see section 8.1.5).
 */
void SSD1306_Init(void) {
    HAL_Delay(100);                // Stabilization delay after power-on (sec. 8.9 Power ON sequence)

	WriteCmd(0xAE);                // Display OFF (sleep mode) while configuring (sec. 10.1.12)

	WriteCmd(0x20);                // Set Memory Addressing Mode (sec. 10.1.3)...
	WriteCmd(0x10);                // ...argument: A[1:0]=10b -> Page Addressing Mode

	WriteCmd(0xB0);                // Set Page Start Address = PAGE0, for Page Addressing Mode (sec. 10.1.13)

	WriteCmd(0xC8);                // Set COM Output Scan Direction remapped: COM[N-1] -> COM0 (sec. 10.1.14),
	                                // flips the image vertically to match the module's mounting

	WriteCmd(0x00);                // Set Lower Column Start Address = 0 (low nibble) (sec. 10.1.1)
	WriteCmd(0x10);                // Set Higher Column Start Address = 0 (high nibble) (sec. 10.1.2)

	WriteCmd(0x40);                // Set Display Start Line = 0 (RAM row 0 -> COM0) (sec. 10.1.6)

	WriteCmd(0x81);                // Set Contrast Control for BANK0 (sec. 10.1.7)...
	WriteCmd(0xFF);                // ...argument: contrast = 0xFF (maximum, out of 256 steps)

	WriteCmd(0xA1);                // Set Segment Re-map: column 127 -> SEG0 (sec. 10.1.8),
	                                // flips the image horizontally (together with 0xC8, corrects the mounting)

	WriteCmd(0xA6);                // Set Normal Display: a RAM bit of 1 = pixel ON (sec. 10.1.10)

	WriteCmd(0xA8);                // Set Multiplex Ratio (sec. 10.1.11)...
	WriteCmd(0x3F);                // ...argument: N-1=63 -> MUX 1:64 (64-row panel)

	WriteCmd(0xA4);                // Entire Display ON = follows GDDRAM content (does not force everything ON) (sec. 10.1.9)

	WriteCmd(0xD3);                // Set Display Offset (sec. 10.1.15)...
	WriteCmd(0x00);                // ...argument: no vertical shift (offset = 0)

	WriteCmd(0xD5);                // Set Display Clock Divide Ratio / Oscillator Frequency (sec. 10.1.16)...
	WriteCmd(0xF0);                // ...argument: A[7:4]=Fosc=1111b (high frequency), A[3:0]=divide ratio-1=0 (ratio=1)

	WriteCmd(0xD9);                // Set Pre-charge Period (sec. 10.1.17)...
	WriteCmd(0x22);                // ...argument: Phase1=2 DCLK, Phase2=2 DCLK (default values)

	WriteCmd(0xDA);                // Set COM Pins Hardware Configuration (sec. 10.1.18)...
	WriteCmd(0x12);                // ...argument: A[4]=1 alternative COM pin config, A[5]=0 no left/right remap

	WriteCmd(0xDB);                // Set VCOMH Deselect Level (sec. 10.1.19)...
	WriteCmd(0x20);                // ...argument: ~0.77 x VCC (default value)

	WriteCmd(0x8D);                // Charge Pump Setting (not detailed in this datasheet revision, but it's the
	                                // standard SSD1306 command for the internal charge-pump regulator)...
	WriteCmd(0x14);                // ...argument: 0x14 = enables the internal charge pump
	                                // (mandatory: without it, the OLED panel doesn't get enough voltage)

	WriteCmd(0xAF);                // Display ON: exits sleep mode and starts refreshing the panel (sec. 10.1.12)
}

