Mabeltranpe1/stm32-course-mabeltranpe/Clase_librerias_hal/Src/parcial_final.c
/*
 * SSD1306_Fill
 *
 * Fills the whole local framebuffer (SSD1306_Buffer, 1024 bytes = 128 columns
 * x 8 pages, one byte per column per page) with a solid color. This only
 * touches the RAM copy in the MCU — nothing is sent to the display until
 * SSD1306_UpdateScreen() pushes the buffer out over I2C.
 */
void SSD1306_Fill(uint8_t color) {
	memset(SSD1306_Buffer, (color == 0)?0:0xFF, sizeof(SSD1306_Buffer));
	// color == 0 -> 0x00 per byte (all 8 pixels of the byte OFF)
	// color != 0 -> 0xFF per byte (all 8 pixels of the byte ON)
}

/*
 * SSD1306_UpdateScreen
 *
 * Flushes the local framebuffer (SSD1306_Buffer) to the SSD1306's GDDRAM
 * over I2C, one page (8-pixel-tall row) at a time, matching the Page
 * Addressing Mode configured in SSD1306_Init() (sec. 10.1.3).
 */
void SSD1306_UpdateScreen(void) {
    for(int i=0; i<8; i++) {
        // Point the controller at the start of page i, column 0, before
        // sending that page's data (sec. 10.1.13 Page Start Address,
        // sec. 10.1.1/10.1.2 Column Start Address low/high nibble)
        WriteCmd(0xB0+i);
        WriteCmd(0x00);
        WriteCmd(0x10);

        // Write the 128 bytes of page i to GDDRAM. Using register 0x40
        // (instead of 0x00) sets D/C#=1, i.e. "this is pixel data, not a
        // command" (sec. 8.1.5). The column pointer auto-increments after
        // each byte (Table 9-3), so the whole page is written in one shot.
        HAL_I2C_Mem_Write(&hi2c, SSD1306_ADDR, 0x40, 1, &SSD1306_Buffer[128*i], 128, 50);
    }
}

/*
 * SSD1306_DrawPixel
 *
 * Sets or clears a single pixel in the local framebuffer, using the same
 * byte layout the SSD1306 expects in GDDRAM: the buffer is organized as
 * 8 pages of 128 columns, and within a byte, bit 0 is the top row of the
 * page and bit 7 is the bottom row (LSB-first, vertically).
 */
void SSD1306_DrawPixel(uint8_t x, uint8_t y, uint8_t color) {
    if(x>=128 || y>=64) return;                                   // off-screen, ignore (also catches the
                                                                     // x-1/y-1 underflow used by SSD1306_DrawCross)
    if(color){
    	SSD1306_Buffer[x+(y/8)*128] |= (1<<(y%8));          // turn the pixel ON: set its bit
    }
    else {
    	SSD1306_Buffer[x+(y/8)*128] &= ~(1<<(y%8));         // turn the pixel OFF: clear its bit
    }
    // byte index  x + (y/8)*128 : column x, page (y/8)   -> selects the byte
    // bit index   y % 8                                  -> selects the row within that page
}

/*
 * SSD1306_WriteString
 *
 * Draws a null-terminated ASCII string into the framebuffer starting at
 * pixel (x,y), using the 5x7 bitmap font table (Font5x7[]). Each glyph is
 * 5 pixels wide plus 1 blank column of spacing, so the cursor advances by
 * 6 pixels per character.
 */
void SSD1306_WriteString(uint8_t x, uint8_t y, char* str) {
    while(*str) {
        char c = *str;
        uint8_t idx = 0;
        if (c >= 32 && c <= 126){
        	idx = c - 32;   // Font5x7[] starts at the space character (ASCII 32)
        }
        else {
        	idx = 0;                            // anything outside the printable range falls back to space
        }

        for(int i=0; i<5; i++) {                // walk the 5 columns of the glyph
            uint8_t b = Font5x7[idx][i];        // column i's pixel pattern, bit 0 = top row
            for(int j=0; j<8; j++){				// move cursor to the next character slot (5px glyph + 1px gap)
            	if((b>>j)&1){
            		SSD1306_DrawPixel(x+i, y+j, 1); // plot each set bit as an ON pixel at (x+i, y+j)
            	}
            }

        }
        x += 6;
        str++;
    }
}

/*
 * SSD1306_DrawCross
 *
 * Draws a small "+" cursor centered at (x,y) — used to mark the joystick
 * position — plus a fixed rectangular frame occupying the bottom-right
 * quadrant of the screen (columns 64-127, rows 18-63), which acts as the
 * static border of the "JOYSTICK" sub-screen. The frame is redrawn every
 * call since SSD1306_Fill() clears the whole buffer each frame.
 */
void SSD1306_DrawCross(uint8_t x, uint8_t y) {
    // The 5 pixels of the cross: center + one neighbor in each direction.
    // If x or y is 0, x-1/y-1 underflow to 255 (uint8_t), but SSD1306_DrawPixel's
    // bounds check silently discards it, so this is safe.
    SSD1306_DrawPixel(x, y, 1);
    SSD1306_DrawPixel(x-1, y, 1);
    SSD1306_DrawPixel(x+1, y, 1);
    SSD1306_DrawPixel(x, y-1, 1);
    SSD1306_DrawPixel(x, y+1, 1);
}


/*
 * SSD1306_DrawEmptyRect
 *
 * Draws an unfilled rectangle outline: top-left corner at (x_zero, y_zero),
 * x_wide pixels wide and y_height pixels tall. x_wide/y_height are a SIZE,
 * not an end coordinate — the function converts them to the actual right/
 * bottom edge (x_end/y_end) internally before drawing.
 *
 * Bug history: the previous version used x_wide/y_height directly as the
 * end coordinates in the loop conditions. That happened to look right for
 * the big rectangle call (where the caller passed literal end coordinates
 * that were numerically larger than a real width/height), but broke for the
 * small square call (16, 20, 20, 20): with y_zero == y_height == 20 the
 * vertical loop "for(i=20; i<20; i++)" never ran, and the horizontal loop
 * drew both the "top" and "bottom" edge on the same row 20 — hence only one
 * line was visible instead of a square.
 */
void SSD1306_DrawEmptyRect(uint8_t x_zero, uint8_t y_zero, uint8_t x_wide, uint8_t y_height) {
	uint8_t x_end = x_zero + x_wide;    // right edge column = left edge + width
	uint8_t y_end = y_zero + y_height;  // bottom edge row   = top edge + height

	// Top border (row y_zero) and bottom border (row y_end), from column x_zero to x_end
    for(int i = x_zero; i <= x_end; i++) {
    	SSD1306_DrawPixel(i, y_zero, 1); // Top limit
    	SSD1306_DrawPixel(i, y_end, 1);  // Bottom limit
    }

    // Left border (column x_zero) and right border (column x_end), from row y_zero to y_end
    for(int i = y_zero; i <= y_end; i++) {
    	SSD1306_DrawPixel(x_zero, i, 1);
    	SSD1306_DrawPixel(x_end, i, 1);
    }

