Mabeltranpe1/stm32-course-mabeltranpe/Clase_librerias_hal/Src/parcial_final.c
}

void mco1_Init(char port){

	GPIO_InitTypeDef gpio_mco = {0};
	/*LO PRIMERO QUE DEBO HACER ES CONFIGURAR EL GPIO8
	 * ESTA CONFIGURACION ES REDUNDANTE YA QUE EN EL ARCHIVO DRIVER DE RCC EN LA FUNCION DE HALL_RCC_MCOConfig
	 * YA ACTIVA POR SI MISMO EL PIN*/

	gpio_mco.Pin = GPIO_PIN_8;
	gpio_mco.Mode = GPIO_MODE_AF_OD ;
	gpio_mco.Pull = GPIO_NOPULL ;
	gpio_mco.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	gpio_mco.Alternate = GPIO_AF0_MCO;

	HAL_GPIO_Init(GPIOA,&gpio_mco);

	cmo1_output = port;

	if (port == 'h'){
		HAL_RCC_MCOConfig (RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_4);
	}
	else if (port == 'l'){
		HAL_RCC_MCOConfig (RCC_MCO1, RCC_MCO1SOURCE_LSE, RCC_MCODIV_1);
	}
	else if (port == 'p'){
		HAL_RCC_MCOConfig (RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_5);

	}

}

void graficar_pantalla (void){

	switch (pantalla){
	case 0:
		SSD1306_Fill(0);

		RTC_TimeTypeDef time_Now = {0};
		RTC_DateTypeDef Date_Now = {0};
		HAL_RTC_GetTime(&hrtc,&time_Now, RTC_FORMAT_BIN);
		HAL_RTC_GetDate(&hrtc,&Date_Now, RTC_FORMAT_BIN);
		sprintf((char *)tiempo_actual, "%02d:%02d:%02d", time_Now.Hours, time_Now.Minutes, time_Now.Seconds);
		SSD1306_WriteString( 34, 0, "CRONOMETRO");
		SSD1306_WriteString(20, 25, (char *)tiempo_actual);
		if (nuevo_tiempo == 1){
			SSD1306_WriteString(20, 35, (char *)get_time);
		}
		SSD1306_UpdateScreen();
		break;



	case 1:

		mpu6050_Read();

		SSD1306_Fill(0);

		SSD1306_WriteString(34, 0, "ACELEROMETRO");

		sprintf((char *)msg, "X:%.2f", Ax);
		SSD1306_WriteString(10, 20, (char *)msg);

		sprintf((char *)msg, "Y:%.2f", Ay);
		SSD1306_WriteString(10, 30, (char *)msg);

		sprintf((char *)msg, "Z:%.2f", Az);
		SSD1306_WriteString(10, 40, (char *)msg);

		SSD1306_UpdateScreen();
		break;

	case 2:
		SSD1306_Fill(0);
		SSD1306_WriteString(40, 0, "MCO1");

		if (cmo1_output== 'h'){
			SSD1306_WriteString(0, 20, "HSI: 16MHz");
			SSD1306_WriteString(0, 30, "Div4: 4MHz");
		}
		else if (cmo1_output == 'l'){
			SSD1306_WriteString(0, 20, "LSE: 32.768KHz");
			SSD1306_WriteString(0, 30, "Div1: 32.768KHz");
		}
		else if (cmo1_output == 'p'){
			SSD1306_WriteString(0, 20, "PLL: 100MHz");
			SSD1306_WriteString(0, 30, "Div5: 20MHz");
		}

		SSD1306_UpdateScreen();
		break;

	default: break;
	}
}




void actualization_case (uint8_t caso){
	switch(caso){
		case 'h': case 'p': case 'l':
			mco1_Init(caso);
			break;
		case 'n':
			graficar_pantalla();
			if (pantalla < 2){
				pantalla += 1;
			}
			else{
				pantalla = 0;
			}
			break;
		case 'r':
			actualizacion_cronometro();
			break;
		default: break;
	}
}

void actualizacion_cronometro(void){
	nuevo_tiempo = 1;   //ESTA BANDERA ME DICE QUE YA SE HA OPRIMIDO R AL MENOS UNA VES, NUNCA VUELVO A BAJAR LA BANDERA YA QUE SIEMPRE QUIERO QUE SE MUESTRE EL TIEMPO QUE YA HE TOMADO ANTES
	RTC_TimeTypeDef time_Now = {0};
	RTC_DateTypeDef Date_Now = {0};
	HAL_RTC_GetTime(&hrtc,&time_Now, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc,&Date_Now, RTC_FORMAT_BIN);
	sprintf((char *)get_time, "%02d:%02d:%02d", time_Now.Hours, time_Now.Minutes, time_Now.Seconds);
	RTC_TimeTypeDef time_format = {0};
	RTC_DateTypeDef date_format = {0};
	HAL_RTC_SetTime(&hrtc, &time_format, RTC_FORMAT_BIN);
	HAL_RTC_SetDate(&hrtc, &date_format, RTC_FORMAT_BIN);

}
/* ----------- INTERRUPCIONES -----------*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef * huart){
	if (huart->Instance == USART2){
		huart_flag = 1;  //SE ACTIVA UNA BANDERA PARA QUE LA LOGICA FUERTE SE EJECUTE DENTRO DEL MAIN Y NO EN LA INTERRUPCION
		HAL_UART_Receive_IT(huart, &RXchange, 1);  //SE BAJA LA BANDERA ESPERANDO QUE HAYA UNA NUEVA INTERRUPCION
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if (htim->Instance == TIM4)
	{
		HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);  //SE CAMBIA EL ESTADO DEL PIN ENTRE HIGH Y LOW

	}
}

